; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=88, out_folder=htg/blocksworld/training, instance_id=68, seed=2092, goal_proportion=0.1

(define (problem blocksworld-68)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 - object)
 (:init 
    (arm-empty)
    (clear b77)
    (on b77 b9)
    (on b9 b20)
    (on b20 b47)
    (on-table b47)
    (clear b75)
    (on-table b75)
    (clear b63)
    (on-table b63)
    (clear b83)
    (on-table b83)
    (clear b10)
    (on-table b10)
    (clear b23)
    (on b23 b31)
    (on-table b31)
    (clear b71)
    (on b71 b69)
    (on b69 b85)
    (on-table b85)
    (clear b88)
    (on b88 b80)
    (on-table b80)
    (clear b57)
    (on b57 b37)
    (on b37 b24)
    (on b24 b25)
    (on b25 b35)
    (on b35 b66)
    (on b66 b33)
    (on b33 b16)
    (on b16 b2)
    (on-table b2)
    (clear b27)
    (on b27 b38)
    (on b38 b26)
    (on b26 b44)
    (on b44 b78)
    (on-table b78)
    (clear b59)
    (on-table b59)
    (clear b48)
    (on-table b48)
    (clear b41)
    (on b41 b12)
    (on b12 b54)
    (on b54 b14)
    (on-table b14)
    (clear b1)
    (on b1 b5)
    (on b5 b61)
    (on b61 b72)
    (on b72 b4)
    (on b4 b40)
    (on b40 b29)
    (on-table b29)
    (clear b7)
    (on b7 b22)
    (on b22 b36)
    (on b36 b76)
    (on b76 b43)
    (on b43 b18)
    (on b18 b68)
    (on-table b68)
    (clear b32)
    (on b32 b60)
    (on b60 b53)
    (on b53 b17)
    (on b17 b62)
    (on-table b62)
    (clear b74)
    (on b74 b34)
    (on b34 b3)
    (on b3 b58)
    (on b58 b52)
    (on b52 b8)
    (on b8 b67)
    (on b67 b6)
    (on b6 b30)
    (on b30 b56)
    (on b56 b39)
    (on-table b39)
    (clear b73)
    (on b73 b81)
    (on b81 b45)
    (on b45 b15)
    (on b15 b19)
    (on b19 b51)
    (on-table b51)
    (clear b64)
    (on b64 b21)
    (on b21 b70)
    (on b70 b11)
    (on b11 b87)
    (on b87 b79)
    (on b79 b13)
    (on b13 b49)
    (on b49 b84)
    (on-table b84)
    (clear b42)
    (on b42 b65)
    (on b65 b46)
    (on-table b46)
    (clear b28)
    (on b28 b50)
    (on b50 b55)
    (on-table b55)
    (clear b82)
    (on b82 b86)
    (on-table b86))
 (:goal  (and 
    (clear b1)
    (on b1 b5)
    (on b5 b7)
    (on-table b7)
    (clear b4)
    (on b4 b8)
    (on b8 b2)
    (on-table b2)
    (clear b6)
    (on b6 b3)
    (on-table b3))))

; plan
1. (unstack b7 b22)
   deleted: (on b7 b22) (clear b7) (arm-empty)
   added: (holding b7) (clear b22)
   goals met: 3 of 11
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 4 of 11
3. (unstack b74 b34)
   deleted: (on b74 b34) (clear b74) (arm-empty)
   added: (holding b74) (clear b34)
   goals met: 4 of 11
4. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 4 of 11
5. (unstack b34 b3)
   deleted: (on b34 b3) (clear b34) (arm-empty)
   added: (holding b34) (clear b3)
   goals met: 4 of 11
6. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 4 of 11
7. (unstack b3 b58)
   deleted: (on b3 b58) (clear b3) (arm-empty)
   added: (holding b3) (clear b58)
   goals met: 4 of 11
8. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 5 of 11
9. (unstack b58 b52)
   deleted: (on b58 b52) (clear b58) (arm-empty)
   added: (holding b58) (clear b52)
   goals met: 5 of 11
10. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 5 of 11
11. (unstack b52 b8)
   deleted: (on b52 b8) (clear b52) (arm-empty)
   added: (holding b52) (clear b8)
   goals met: 5 of 11
12. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 5 of 11
13. (unstack b8 b67)
   deleted: (on b8 b67) (clear b8) (arm-empty)
   added: (holding b8) (clear b67)
   goals met: 5 of 11
14. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 5 of 11
15. (unstack b67 b6)
   deleted: (on b67 b6) (clear b67) (arm-empty)
   added: (holding b67) (clear b6)
   goals met: 6 of 11
16. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 6 of 11
17. (unstack b57 b37)
   deleted: (on b57 b37) (clear b57) (arm-empty)
   added: (holding b57) (clear b37)
   goals met: 6 of 11
18. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 6 of 11
19. (unstack b6 b30)
   deleted: (on b6 b30) (clear b6) (arm-empty)
   added: (holding b6) (clear b30)
   goals met: 5 of 11
20. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 7 of 11
21. (unstack b37 b24)
   deleted: (on b37 b24) (clear b37) (arm-empty)
   added: (holding b37) (clear b24)
   goals met: 7 of 11
22. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 7 of 11
23. (unstack b24 b25)
   deleted: (on b24 b25) (clear b24) (arm-empty)
   added: (holding b24) (clear b25)
   goals met: 7 of 11
24. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 7 of 11
25. (unstack b25 b35)
   deleted: (on b25 b35) (clear b25) (arm-empty)
   added: (holding b25) (clear b35)
   goals met: 7 of 11
26. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 7 of 11
27. (unstack b35 b66)
   deleted: (on b35 b66) (clear b35) (arm-empty)
   added: (holding b35) (clear b66)
   goals met: 7 of 11
28. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 7 of 11
29. (unstack b66 b33)
   deleted: (on b66 b33) (clear b66) (arm-empty)
   added: (holding b66) (clear b33)
   goals met: 7 of 11
30. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 7 of 11
31. (unstack b33 b16)
   deleted: (on b33 b16) (clear b33) (arm-empty)
   added: (holding b33) (clear b16)
   goals met: 7 of 11
32. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 7 of 11
33. (unstack b16 b2)
   deleted: (on b16 b2) (clear b16) (arm-empty)
   added: (holding b16) (clear b2)
   goals met: 7 of 11
34. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 7 of 11
35. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 7 of 11
36. (stack b8 b2)
   deleted: (clear b2) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b2)
   goals met: 8 of 11
37. (unstack b1 b5)
   deleted: (on b1 b5) (clear b1) (arm-empty)
   added: (holding b1) (clear b5)
   goals met: 6 of 11
38. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 7 of 11
39. (unstack b5 b61)
   deleted: (on b5 b61) (clear b5) (arm-empty)
   added: (holding b5) (clear b61)
   goals met: 7 of 11
40. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 8 of 11
41. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 11
42. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 9 of 11
43. (unstack b61 b72)
   deleted: (on b61 b72) (clear b61) (arm-empty)
   added: (holding b61) (clear b72)
   goals met: 9 of 11
44. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 9 of 11
45. (unstack b72 b4)
   deleted: (on b72 b4) (clear b72) (arm-empty)
   added: (holding b72) (clear b4)
   goals met: 10 of 11
46. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 10 of 11
47. (unstack b4 b40)
   deleted: (on b4 b40) (clear b4) (arm-empty)
   added: (holding b4) (clear b40)
   goals met: 9 of 11
48. (stack b4 b8)
   deleted: (clear b8) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b8)
   goals met: 11 of 11
